---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.ForwardIterator
source: html/7ca07b40-41f7-2ace-1f6d-8ffec0704e82.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SlabShapeVertexArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.